#include "pch.h"

Shape Figure::types[] = {
	{ 8, R"(
						лл
						лл
	)", R"(
						лл
						лл
	)", R"(
						лл
						лл
	)", R"(
						лл
						лл
	)" },					// 0
	{ 9, R"(
						л
						ллл
	)", {R"(
						лл
						л
						л
	)", 1, 0}, {R"(
						ллл
						  л
	)",-1, 1}, {R"(
						 л
						 л
						лл
	)",0,-1} },				// 1
	{ 10, R"(
						  л
						ллл
	)", {R"(
						л
						л
						лл
	)", 1, 0}, {R"(
						ллл
						л
	)",-1, 1}, {R"(
						лл
						 л
						 л
	)",0,-1} },				// 2
	{ 11, {R"(
						лллл
	)",-1,1}, {R"(
						л
						л
						л
						л
	)", 2, -1}, {R"(
						лллл
	)",-2, 2}, {R"(
						л
						л
						л
						л
	)",1,-2} },				// 3
	{ types[3] }, // 4
	{ 12, R"(
						 л
						ллл
	)", {R"(
						л
						лл
						л
	)", 1, 0}, {R"(
						ллл
						 л
	)",-1, 1}, {R"(
						 л
						лл
						 л
	)",0,-1} },				// 5
	{ 13, R"(
						 лл
						лл
	)", {R"(
						л
						лл
						 л
	)", 1, 0}, {R"(
						 лл
						лл 
	)",-1, 1}, {R"(
						л
						лл
						 л
	)",0,-1} },				// 6
	{ 14, R"(
						лл
						 лл
	)", {R"(
						 л
						лл
						л
	)", 1, 0}, {R"(
						лл
						 лл
	)",-1, 1}, {R"(
						 л
						лл
						л
	)",0,-1} },				// 7
	//{ R"(
	//					лллл
	//					л
	//					л
	//					л
	//)", R"(
	//					лллл
	//					   л
	//					   л
	//					   л
	//)", R"(
	//					   л
	//					   л
	//					   л
	//					лллл
	//)", R"(
	//					л
	//					л
	//					л
	//					лллл
	//)" },			// 8
};

const int Figure::figures = _countof(types);